Day 2: How do I select a pandas Series from a DataFrame?
There are two type of object type in pandas - Dataframe and Series. 
Dataframe is like a table and each column is called a series. You will often select a Series
in order to analyze or manipulate it. 
- How to select a series using "bracket notation" and "dot notation",
- How to create a new Series in a dataframe.

In [1]:
import pandas as pd

In [5]:
# ufo = pd.read_table('https://bit.ly/uforeports', sep=',') # This will work as the data is in csv format
ufo = pd.read_csv('https://bit.ly/uforeports') # read_csv will take ',' as the default separator.

In [7]:
type(ufo)

pandas.core.frame.DataFrame

In [9]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [17]:
# ufo['City'] # This is a way to select just the cities within the dataframe

#type(ufo['City']) # This is to check if we are getting series data.
# For dot notation to work the name should not have spaces. -----> Important.
# Have to use the bracket notation
# This is also valid if you name a column with the same name as the built-in method or attribute. Example shape is column name, if you are trying to get shape, which is also a built-in attribute in pandas.dataframe it will not return the series dataframe.

ufo['Colors Reported']

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
        ...
18236    NaN
18237    NaN
18238    NaN
18239    RED
18240    NaN
Name: Colors Reported, Length: 18241, dtype: object

In [15]:
ufo.City

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

How to create a new series in existing dataframe?

In [19]:
'ad'+ 'cd'

'adcd'

In [24]:
ufo['Location'] = ufo.City +', '+ ufo.State # This will create a new column in the existing dataframe

In [25]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"